In [1]:
%pylab inline
from pandas import Series,DataFrame
import pandas as pd

Populating the interactive namespace from numpy and matplotlib

In [2]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002], 
        'population': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data, columns=['year', 'state', 'population', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame

       year   state  population debt
one    2000    Ohio         1.5  NaN
two    2001    Ohio         1.7  NaN
three  2002    Ohio         3.6  NaN
four   2001  Nevada         2.4  NaN
five   2002  Nevada         2.9  NaN

In [3]:
frame.head()

       year   state  population debt
one    2000    Ohio         1.5  NaN
two    2001    Ohio         1.7  NaN
three  2002    Ohio         3.6  NaN
four   2001  Nevada         2.4  NaN
five   2002  Nevada         2.9  NaN

In [4]:
frame.tail(2)

      year   state  population debt
four  2001  Nevada         2.4  NaN
five  2002  Nevada         2.9  NaN

In [7]:
frame.describe()

             year  population
count     5.00000    5.000000
mean   2001.20000    2.420000
std       0.83666    0.864292
min    2000.00000    1.500000
25%    2001.00000    1.700000
50%    2001.00000    2.400000
75%    2002.00000    2.900000
max    2002.00000    3.600000